app/controllers/application_controller.rb

  def home
    @posts = Post.paginate(:page => params[:page], :per_page => 5)
---
SELECT "posts".* FROM "posts" LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "posts"