app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(:page => params[:page], :per_page => 5)
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("corpo", "created_at", "titulo", "updated_at", "usuario_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["corpo", ""], ["created_at", Sat, 15 Nov 2014 18:04:59 UTC +00:00], ["titulo", ""], ["updated_at", Sat, 15 Nov 2014 18:04:59 UTC +00:00], ["usuario_id", 1]]