app/controllers/sessions_controller.rb

INSERT INTO "usuarios" ("access_token", "created_at", "email", "moderador", "name", "photo_url", "provider", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    auth = request.env["omniauth.auth"]
    usuario = Usuario.find_or_create_with_omniauth(auth)