app/controllers/usuarios_controller.rb

SELECT "usuarios".* FROM "usuarios" LIMIT 10 OFFSET 0
---
  def index
    @usuarios = Usuario.paginate(:page => params[:page], :per_page => 10)

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "usuarios" SET "moderador" = 't', "updated_at" = '2014-11-16 19:04:39.285219' WHERE "usuarios"."id" = 2
---
  def update
    @usuario = Usuario.find(params[:id])

    respond_to do |format|
      if @usuario.update_attributes(params[:usuario])